DataProcessors/РабочееМестоКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоКассира</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидОперацииРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассаККМРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НалогообложениеНДСРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассирРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДисконтнаяКартаРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗаказПокупателяРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументРасчетаРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияСДенежнымиСредствами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецПодарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьПодарокВЧек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗаказПокупателяРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПродавца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_3РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_3РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеобходимостьВводаКодаМаркировки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеобходимостьВводаСерии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПартияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подарок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПродавецРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число5_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число5_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемаНалогообложения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипыСистемНалогообложенияККТРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДСРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НеотрицательноеЧисло15_2_РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НеотрицательноеЧисло15_2_РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НеотрицательноеЧисло15_2_РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиНаценки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиОплатыБонусом</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УпаковкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеВариантУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВариантУчетаЧастичногоВыбытияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеНоменклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеХарактеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЯчейкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимИдентификаторЗапросаГИСМТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимДатаЗапросаГИСМТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбытиеБутылки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВидОплатыРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭквайринговыйТерминалРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число5_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСертификата</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерСертификатаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлатежнойСистемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСпособаОплатыЭТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РабочееМестоКассира/Forms/ФормаУправленияКассовойСменойКСО/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СчетчикДоступности;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыФормы();
	НастроитьВидимостьСверкиИтогов();
	ЗаполнитьРеквизитыКассовойСмены(Истина);
	НастроитьДоступностьКомандУправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СверкаИтогов(Команда)
	
	Доступность = Ложь;
	СчетчикДоступности = Терминалы.Количество();
	ДополнительныеПараметры = Неопределено;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговЗавершение", ЭтотОбъект);
	Для Каждого ЭлементТерминал Из Терминалы Цикл
		
		ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		МенеджерОборудованияРМККлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения,
			УникальныйИдентификаторВладельца, ЭлементТерминал.Значение, ПараметрыОперации,
			ДополнительныеПараметры, ИдентификаторКассыККМ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	ОткрытьСменуКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	ЗакрытьСменуКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКПродажам(Команда)
	Закрыть(СменаПерезапущена);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	ЗавершитьРаботуСистемы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДополнительныеПараметрыОткрытияЗакрытияСмены()
	
	ДополнительныеПараметрыОткрытияЗакрытияСмены = Новый Структура();
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("Пользователь", ПользовательБД);
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("Кассир", Кассир);
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("КассаККМ", КассаККМ);
	ДополнительныеПараметрыОткрытияЗакрытияСмены.Вставить("ВариантЗаполненияМестаРасчетов",
		ВариантЗаполненияМестаРасчетов);
	
	Возврат ДополнительныеПараметрыОткрытияЗакрытияСмены;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметрыДляПечати)
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуКлиент()
	
	Доступность = Ложь;
	ЗакрытиеСменыПереопределено = Ложь;
	ОбщегоНазначенияРМККлиентПереопределяемый.ЗакрытьСмену(ЭтотОбъект, ЗакрытиеСменыПереопределено);
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеСменыЗавершение", ЭтотОбъект);
	
	ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ПараметрыОперации.КассаККМ = КассаККМ;
	
	ДополнительныеПараметрыДляПечати = ДополнительныеПараметрыОткрытияЗакрытияСмены();
	ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
	ДополнительныеПараметры = Новый Структура();
	МенеджерОборудованияРМККлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(Оповещение,
		УникальныйИдентификаторВладельца, ИдентификаторКассыККМ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСменуКлиент()
	
	Доступность = Ложь;
	Оповещение = Новый ОписаниеОповещения("ОткрытиеСменыЗавершение", ЭтотОбъект);
	
	ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ДополнительныеПараметрыДляПечати = ДополнительныеПараметрыОткрытияЗакрытияСмены();
	ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметрыДляПечати);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("КассаККМ", КассаККМ);
	ДополнительныеПараметры.Вставить("Магазин", ТорговыйОбъект);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("ОставитьПодключенным", Истина);
	
	МенеджерОборудованияРМККлиент.НачатьОткрытиеСменыНаФискальномУстройстве(Оповещение,
		УникальныйИдентификаторВладельца, ИдентификаторКассыККМ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеСменыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Результат, "Результат") И Не Результат.Результат Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеТекущегоСостоянияККТПриЗакрытии", ЭтотОбъект);
		МенеджерОборудованияРМККлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(
			ОповещениеОЗавершении, УникальныйИдентификаторВладельца, Результат.ИдентификаторУстройства);
		
		ТекстЗаголовка = НСтр("ru = 'При снятии отчета на фискальном регистраторе произошла ошибка.'");
		ТекстСообщения =
			СтрШаблон(НСтр("ru = '""%1""
				|Отчет на фискальном регистраторе не сформирован.'"), Результат.ОписаниеОшибки);
		
		ПоказатьПредупреждение(, ТекстСообщения, , ТекстЗаголовка);
		
	Иначе
		ОбновитьФормуПослеОперацииСКассовойСменой();
		Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеСменыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(Результат, "Результат") И Результат.Результат Тогда
		ОбновитьФормуПослеОперацииСКассовойСменой();
		Доступность = Истина;
	Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеТекущегоСостоянияККТПриОткрытии", ЭтотОбъект);
		МенеджерОборудованияРМККлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(
			ОповещениеОЗавершении, УникальныйИдентификаторВладельца, Результат.ИдентификаторУстройства);
		
		ТекстЗаголовка = НСтр("ru = 'Ошибка открытия смены'");
		
		ЛокализованныйТекстСообщения = СтрШаблон(НСтр("ru = 'При открытии смены произошла ошибка.
			|%1
			|Смена не открыта на фискальном устройстве.'"), Результат.ОписаниеОшибки);
		ПоказатьПредупреждение(, ЛокализованныйТекстСообщения, , ТекстЗаголовка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыКассовойСмены(ПервоначальноеЗаполнение = Ложь)
	
	Перем ДанныеСмены;
	
	Если ПервоначальноеЗаполнение Тогда
		ДанныеСмены = ОбщегоНазначенияРМК.ПолучитьДанныеКассовойСмены(КассоваяСмена);
	Иначе
		ДанныеСмены = ОбщегоНазначенияРМК.ПолучитьДанныеКассовойСмены(, КассаККМ);
		КассоваяСмена = ДанныеСмены.КассоваяСмена;
	КонецЕсли;
	СменаОткрыта = ДанныеСмены.СменаОткрыта;
	Сутки = 86400;
	ДатаТекущая = ТекущаяДатаСеанса();
	ВычислитьАктуальностьСмены(ДанныеСмены, ДатаТекущая);
	
	ШаблонЗаголовка = НСтр("ru = 'Кассовая смена %1 от %2 на ККТ %3 %4.'");
	Если ЗначениеЗаполнено(КассоваяСмена) Тогда
		ТекстСостояния = "";
		Если СменаОткрыта Тогда
			ДатаОкончанияСмены = ДанныеСмены.ДатаОткрытияСмены + Сутки;
			ПрефиксОкончанияСмены = ?(ДатаОкончанияСмены > ДатаТекущая, НСтр("ru = 'истекает'"), НСтр("ru = 'истекла'"));
			ТекстСостояния = СтрШаблон("%1 %2 в %3", ПрефиксОкончанияСмены,
				Формат(ДатаОкончанияСмены, НСтр("ru='ДФ=''dd.MM.yyyy'''")),
				Формат(ДатаОкончанияСмены, "ДФ=HH:mm:ss"));
		Иначе
			ТекстСостояния = НСтр("ru = 'закрыта'");
		КонецЕсли;
		ДатаНачалаСменыСтрокой = Формат(ДанныеСмены.ДатаОткрытияСмены, "");
		ЗаголовокСмены = СтрШаблон(ШаблонЗаголовка, ДанныеСмены.НомерСмены, ДатаНачалаСменыСтрокой,
			ИдентификаторКассыККМ, ТекстСостояния);
	Иначе
		ЗаголовокСмены = НСтр("ru = 'Кассовая смена не была открыта.'");
	КонецЕсли;
	
	Элементы.ОписаниеКассовойСмены.Заголовок = ЗаголовокСмены;
	Если СменаАктуальна Тогда
		Элементы.ОписаниеКассовойСмены.ЦветТекста = ЦветаСтиля.ЦветТекстаПоложительногоЗначения;
	Иначе
		Элементы.ОписаниеКассовойСмены.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекстаРМК;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьКомандУправления()
	
	Элементы.ОткрытьСмену.Доступность = Не СменаОткрыта;
	Элементы.ЗакрытьСмену.Доступность = СменаОткрыта;
	Элементы.ВернутьсяКПродажам.Доступность = СменаАктуальна;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФормуПослеОперацииСКассовойСменой()

	СменаПерезапущена = Истина;
	ЗаполнитьРеквизитыКассовойСмены();
	НастроитьДоступностьКомандУправления();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьСверкиИтогов()
	
	Если Терминалы.Количество() > 0 Тогда
		
		Элементы.СверкаИтогов.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьАктуальностьСмены(ДанныеСмены, ДатаТекущая)
	
	Сутки = 86400;
	ВремяНачалаСменыВСекундах = ВремяНачалаСмены - Дата(1, 1, 1);
	МинимальнаяДатаНачалаСмены = НачалоДня(ДатаТекущая) + ВремяНачалаСменыВСекундах;
	Если ДатаТекущая < МинимальнаяДатаНачалаСмены Тогда
		МинимальнаяДатаНачалаСмены = МинимальнаяДатаНачалаСмены - Сутки;
	КонецЕсли;
	СменаАктуальна = СменаОткрыта;
	Если СменаАктуальна И (ДатаТекущая - ДанныеСмены.ДатаОткрытияСмены >= Сутки
			Или ДанныеСмены.ДатаОткрытияСмены < МинимальнаяДатаНачалаСмены) Тогда
			
		СменаАктуальна = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыФормы()
	
	КассаККМ = Параметры.ПараметрыКассы.КассаККМ;
	ИдентификаторКассыККМ = Параметры.ПараметрыКассы.ИдентификаторУстройства;
	Кассир = Параметры.ПараметрыКассы.Кассир;
	КассоваяСмена = Параметры.ПараметрыКассы.КассоваяСмена;
	ПользовательБД = Параметры.ПараметрыКассы.Пользователь;
	ВремяНачалаСмены = Параметры.ПараметрыКассы.ВремяНачалаСмены;
	ВариантЗаполненияМестаРасчетов = Параметры.ПараметрыКассы.ВариантЗаполненияМестаРасчетов;
	Терминалы.ЗагрузитьЗначения(Параметры.ПараметрыКассы.ИдентификаторыТерминалов);
	УникальныйИдентификаторВладельца = Параметры.ПараметрыКассы.УникальныйИдентификаторВладельца;
	Организация = Параметры.ПараметрыКассы.Организация;
	ТорговыйОбъект = Параметры.ПараметрыКассы.ТорговыйОбъект;
	РабочееМесто = Параметры.ПараметрыКассы.РабочееМесто;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	СчетчикДоступности = СчетчикДоступности - 1;
	Если СчетчикДоступности = 0 Тогда
		Доступность = Истина;
	КонецЕсли;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеТекущегоСостоянияККТПриОткрытии(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения = Неопределено И ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Если РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Свойство("СтатусСмены") Тогда
			Если РезультатВыполнения.Результат 
				И (РезультатВыполнения.СтатусСмены = 2 ИЛИ РезультатВыполнения.СтатусСмены = 3) Тогда //2-открыта, 3-просрочена
			
				ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКассовуюСменуВручную", ЭтотОбъект, РезультатВыполнения);
				ТекстВопроса = НСтр("ru='Актуализировать кассовую смену в программе?
					|Кассовая смена в программе будет открыта, при этом чек об открытии смены не будет распечатан.'");
				ЗаголовокВопроса = НСтр("ru='На ККТ смена уже была открыта ранее.'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКассовуюСменуВручную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		НомерСменыККТ = Результат.НомерСменыККТ;
		
		ПараметрыКассовойСмены = Новый Структура();
		ПараметрыКассовойСмены.Вставить("НомерСменыККТ", НомерСменыККТ);
		ПараметрыКассовойСмены.Вставить("КассаККМ", КассаККМ);
		ПараметрыКассовойСмены.Вставить("ИдентификаторКассыККМ", ИдентификаторКассыККМ);
		ПараметрыКассовойСмены.Вставить("РабочееМесто", РабочееМесто);
		
		Отказ = Ложь;
		СоздатьДокументКассоваяСменаБезТО(ПараметрыКассовойСмены, Отказ);
		
		Если Не Отказ Тогда
			ОбновитьФормуПослеОперацииСКассовойСменой();
		Иначе
			
			ТекстЗаголовка = НСтр("ru = 'Ошибка открытия смены'");
			ТекстОшибки = НСтр("ru = 'При открытии смены произошла ошибка. Смена не открыта.'");
			ПоказатьПредупреждение(, ТекстОшибки, , ТекстЗаголовка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеТекущегоСостоянияККТПриЗакрытии(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения = Неопределено И ТипЗнч(РезультатВыполнения) = Тип("Структура") Тогда
		Если РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Свойство("СтатусСмены") Тогда
			Если РезультатВыполнения.Результат И РезультатВыполнения.СтатусСмены = 1 Тогда //1-закрыта
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьКассовуюСменуВручную", ЭтотОбъект, РезультатВыполнения);
				ТекстВопроса = НСтр("ru='Актуализировать кассовую смену в программе?
					|Кассовая смена в программе будет закрыта, при этом отчет о закрытии смены не будет распечатан.'");
				ЗаголовокВопроса = НСтр("ru='На ККТ смена уже была закрыта ранее.'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКассовуюСменуВручную(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Отказ = Ложь;
		ЗакрытьКассовуюСменуВДокументеБезТО(Отказ, КассоваяСмена);
		
		Если Не Отказ Тогда
			ОбновитьФормуПослеОперацииСКассовойСменой();
		Иначе
			
			ТекстЗаголовка = НСтр("ru = 'Ошибка закрытия смены'");
			ТекстОшибки = НСтр("ru = 'При закрытии смены произошла ошибка. Смена не закрыта.'");
			ПоказатьПредупреждение(, ТекстОшибки, , ТекстЗаголовка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакрытьКассовуюСменуВДокументеБезТО(Отказ, КассоваяСмена)
	ОбщегоНазначенияРМК.ЗакрытьКассовуюСменуБезОборудования(Отказ, КассоваяСмена);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокументКассоваяСменаБезТО(ПараметрыКассовойСмены, Отказ)
	ОбщегоНазначенияРМК.ОткрытьКассовуюСменуБезОборудования(Отказ, ПараметрыКассовойСмены);
КонецПроцедуры

#КонецОбласти
